Revit 2027 API
ElectricalDemandFactorDefinition.IncludeAdditionalLoad Property
 Should the additional load (if set) be included in demand load calculations.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IncludeAdditionalLoad { get; set; }
Public Property IncludeAdditionalLoad As Boolean
	Get
	Set
public:
property bool IncludeAdditionalLoad {
	bool get ();
	void set (bool value);
}
member IncludeAdditionalLoad : bool with get, set
Property Value
Boolean
See Also
Reference
ElectricalDemandFactorDefinition Class
Autodesk.Revit.DB.Electrical Namespace